{
    "fi": {
        "main": "Etusivu",
        "mainContent": "Näillä nettisivuilla esittelen itseni sekä joitain ohjelmointiprojektejani. -Mikko :)",
        "aboutme": "Esittely",
        "aboutme_intro": "Hei, nimeni on Mikko. Olen laskennallisen tekniikan kandidaatti. Teen parhaillaan maisteriopintojani. Pääaineeni on teknillinen matematiikka ja sivuaineeni tietotekniikka. Olen työskennellyt ohjelmistokehittäjänä sekä tehnyt tutkimus-ja kehitystyötä satelliittikommunikaatioalalla. Olen erityisen kiinnostunut matematiikasta, algoritmeistä, ohjelmoinnista ja suurteholaskennasta. Voit löytää yritykselle tekemäni kandidaatintyön \"GPGPU in System Simulations\"",
        "aboutme_p_langs": "Taitoja:",
        "aboutme_langs": "Kielitaito:",
        "aboutme_fi": "suomi (äidinkieli)",
        "aboutme_en": "englanti",
        "aboutme_swe": "ruotsi",
        "aboutme_ru": "venäjä (alkeet)",
        "aboutme_projects": "Toteutuksia: ",
        "projects": "Projekteja",
        "here": "täältä",
        "this_site_project": "Tämä sivusto",
        "this_site": "Tämä Single-Page Applikaatio toteutettiin React.js:llä. Projektin repository: ",
        "name_file_analyzer": "Ohjelma lukee ja analysoi väestörekisterikeskuksen julkaisemia nimitiedostoja. Projektin repository: ",
        "compute_taxes_by_year_and_emission_classes": "Tämä ohjelma lukee ja analysoi Trafin julkaisemia tiedostoja Suomessa rekisteröidyistä autoista. Projektin repository: ",
        "SmartPostApp": "Applikaatio kuvitteelliselle SmartPost-asiakkaalle pakettien luontia ja lähetystä varten. Projektin repository: ",
        "testdatacreator": "Tämä ohjelma lukee txt, csv yms. tiedostoja ja mahdollistaa käyttäjän luoda niistä pienempiä tiedostoja esim. testausta varten. Projektin repository: ",
        "CaloriesCounter": "Kalorilaskuri, joka käyttää SQLlite 3 -tietokantaa. Projektin repository: ",
        "contact": "Yhteystiedot",
        "contactEmail": "Sähköposti: ",
        "contactPhone": "Puhelinnumero:",
        "gh": "GitHub-profiilini: "
    },
    "en": {
        "main": "Front page",
        "mainContent": "On this website I'll introduce myself and some of my programming projects. -Mikko :)",
        "aboutme": "About me",
        "aboutme_intro": "Hey, my name is Mikko. I'm Bachelor of Science in computational engineering. I'm currently performing my master's degree studies. Technomathemathics is my major and Information Technology is my minor. I have worked as a software developer and worked doing Reaserch and Development (R&D) in the field of satellite communications. I'm especially interested in mathemathics, algorithms, programming and high performance computing. You can find my bachelor's thesis \"GPGPU in System Simulations\" which was made to a company from",
        "aboutme_p_langs": "Skills:",
        "aboutme_langs": "Language skills:",
        "aboutme_fi": "Finnish (native)",
        "aboutme_en": "English",
        "aboutme_swe": "Swedish",
        "aboutme_ru": "Russian (the basics)",
        "aboutme_projects": "Implementations: ",
        "projects": "Projects",
        "here": "here",
        "this_site_project": "This site",
        "this_site": "This Single-Page Application was implemented using React.js. See project repository: ",
        "name_file_analyzer": "Program that reads and analyzes name files provided by Finland's Population Register Centre. See the project repo on ",
        "compute_taxes_by_year_and_emission_classes": "This program reads and analyzes csv files provided by Trafi that include data on cars registered in Finland. See the project repo on ",
        "SmartPostApp": "Application for imaginary SmartPost customer to create and send packages. See the project repo on ",
        "testdatacreator": "This program reads txt, csv etc. files with data and allows the user to create smaller files for testing purposes. See the project repo on ",
        "CaloriesCounter": "Calories counter using SQLite 3 -database. See the project repo on ",
        "contact": "Contact",
        "contactEmail": "Email: ",
        "contactPhone": "Phone number:",
        "gh": "My GitHub profile: "
    },
    "ru": {
        "main": "фронт",
        "mainContent": "На этом веб-сайте я представим себя и некоторые из моих программных проектов.",
        "aboutme": "обо мне",
        "aboutme_intro": "Я студент второго курса вычислительной техники в университете технологии Лаппеенранта с техномагематологией, как мои основные и информационные технологии в качестве моего несовершеннолетнего. Меня особенно интересует программирование.",
        "aboutme_p_langs": "Владение языками программирования: ",
        "aboutme_langs": "Языковые навыки:",
        "aboutme_fi": "Финский (родной)",
        "aboutme_en": "английский",
        "aboutme_swe": "шведский",
        "aboutme_ru": "русский",
        "aboutme_projects": "Реализации с перечисленными выше языками: ",
        "projects": "проектов",
        "this_site_project": "этот сайт",
        "name_file_analyzer": "см. в репозитории проекта и ",
        "compute_taxes_by_year_and_emission_classes": "см. в репозитории проекта и ",
        "SmartPostApp": "см. в репозитории проекта и ",
        "testdatacreator": "см. в репозитории проекта и ",
        "contact": "контакт",
        "contactEmail": "е-мейл: ",
        "contactPhone": "номер телефона:"
    }
}